InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Comment>Область -1, Район  - 2, Город - 3, сельский округ - 4, поселок, село - 5</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОбластиВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АдресныйКлассификатор/Forms/УправляемаяФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Функция ЗаполнитьКодыУровней()
	НовыйКодОбластиВКоде           = Цел(Запись.Код / куфиб_УправлениеКонтактнойИнформацией.МаскаОБласти());
	НовыйКодРайонаВКоде            = Цел(Запись.Код / куфиб_УправлениеКонтактнойИнформацией.МаскаРайона()) % 100;	
	НовыйКодНаселенногоПунктаВКоде = Цел(Запись.Код / куфиб_УправлениеКонтактнойИнформацией.МаскаГорода()) % 100000;
	Модифицировали = Ложь;
	Если Запись.КодОбластиВКоде <> НовыйКодОбластиВКоде Тогда
		Запись.КодОбластиВКоде = НовыйКодОбластиВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	Если Запись.КодРайонаВКоде <> НовыйКодРайонаВКоде Тогда
		Запись.КодРайонаВКоде = НовыйКодРайонаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	Если Запись.КодНаселенногоПунктаВКоде <> НовыйКодНаселенногоПунктаВКоде Тогда
		Запись.КодНаселенногоПунктаВКоде = НовыйКодНаселенногоПунктаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	Возврат Модифицировали;
КонецФункции

//Процедура ОбновлениеОтображения()
//	
//	ЭлементыФормы.ПолныйАдрес.Заголовок = УправлениеКонтактнойИнформацией.ПолучитьПолноеНазвание(Код);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьКодыУровней();
КонецПроцедуры
